src/Reports/СоставСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>СоставСегмента</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыФормированияСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыФормированияСегментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодическиОбновлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормироватьВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/СоставСегмента/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сегмент = Параметры.Сегмент;	
	УстановитьВидимостьЭлементовФормы();
	  	
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Вставить("Сегмент", Сегмент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ОбработкаРасшифровки".
//
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Элемент = РасшифроватьЭлемент(Расшифровка);
	Если ЗначениеЗаполнено(Элемент) Тогда
		ПоказатьЗначение(,Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ДобавитьВСегмент(Команда)
	
	Если ТипЗнч(Сегмент) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли ТипЗнч(Сегмент) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда	
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить в сегмент завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДобавитьВСегментЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ДобавитьЭлемент(Результат);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура УдалитьИзСегмента(Команда)
	
	мРасшифровки = Новый Массив();
	Области = Результат.ВыделенныеОбласти;
	
	Для Каждого Область Из Области Цикл
		Для Строка = Область.Верх По Область.Низ Цикл
			Для Столбец = 1 По 200 Цикл
				Расшифровка = Результат.Область("R" + Строка + "C" + Столбец).Расшифровка;
				Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
					мРасшифровки.Добавить(Расшифровка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УдалитьЭлементы(мРасшифровки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СформироватьСегмент(Команда)
	
	Сегменты.Сформировать(Сегмент);
	СкомпоноватьРезультат();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Удаляет выбранные элементы из состава сегмента
//
Процедура УдалитьЭлементы(Расшифровки)
	
	ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	                           
	Для Каждого Расшифровка Из Расшифровки Цикл
		ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка];
		Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Значение = ЗначениеПоляРасшифровки.Значение;
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
				НаборЗаписей = РегистрыСведений.КонтрагентыСегмента.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Сегмент.Установить(Сегмент);
				НаборЗаписей.Отбор.Контрагент.Установить(Значение);
				НаборЗаписей.Записать();			
			ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если Значение.ЭтоГруппа Тогда 
					МассивЭлементов = ПолучитьМассивЭлементов(Значение);
					Для Каждого ЭлементМассива Из МассивЭлементов Цикл 
						НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Сегмент.Установить(Сегмент);
						НаборЗаписей.Отбор.Номенклатура.Установить(ЭлементМассива);
						НаборЗаписей.Записать();
					КонецЦикла;
				Иначе 	
					НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Сегмент.Установить(Сегмент);
					НаборЗаписей.Отбор.Номенклатура.Установить(Значение);
					Попытка
						ЗначениеСледущейРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка+1].ПолучитьПоля()[0].Значение;
					Исключение					
					КонецПопытки;									
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
// Добавляет элемент в состав сегмента
//
Процедура ДобавитьЭлемент(Элемент)
	
	Если ТипЗнч(Элемент) = Тип("Массив") Тогда
		Для каждого ЭлементМассива Из Элемент Цикл
			ДобавитьЭлемент(ЭлементМассива);		
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если Элемент.ЭтоГруппа Тогда 
		МассивЭлементов = ПолучитьМассивЭлементов(Элемент);
		Для каждого ЭлементМассива Из МассивЭлементов Цикл
			ДобавитьЭлемент(ЭлементМассива);		
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запись = РегистрыСведений.КонтрагентыСегмента.СоздатьМенеджерЗаписи();
		Запись.Сегмент = Сегмент;
		Запись.Контрагент = Элемент;		
	ИначеЕсли ТипЗнч(Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда	
		Запись = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
		Запись.Сегмент = Сегмент;
		Запись.Номенклатура = Элемент;
	КонецЕсли;
	
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Строка(Элемент.Наименование) +  НСтр("ru=' уже включен в сегмент.'"))); 
	Иначе
		Запись.Сегмент = Сегмент;
		Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Запись.Контрагент = Элемент;
		ИначеЕсли ТипЗнч(Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда	
			Запись.Номенклатура = Элемент;
		КонецЕсли;		
		Запись.Записать();
		СкомпоноватьРезультат();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Возвращает возможный для просмотра элемент
//
Функция РасшифроватьЭлемент(Расшифровка)
	
	ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка];
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Значение = ЗначениеПоляРасшифровки.Значение;
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение))
				ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
				Возврат Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
// Процедура управляет видимостью элементов формы
//
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если Сегмент.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда 
		Элементы.СформироватьСегмент.Видимость 	= Ложь;
	Иначе 
		Элементы.ДобавитьВСегмент.Видимость 	= Ложь;	
		Элементы.УдалитьИзСегмента.Видимость 	= Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция, возвращает массив подчиненных элементов объекта.
//
Функция ПолучитьМассивЭлементов(Элемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК ЭлементНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Группа", Элемент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭлементНоменклатура");
	
КонецФункции

#КонецОбласти
